Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1189/src/flexspi_config_MIMXRT1189.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#include "bl_flexspi.h"
#include "flexspi_nor_flash.h"
#include "fsl_clock.h"
#include "fsl_device_registers.h"
#include "fusemap.h"
#include "microseconds.h"
#include "peripherals_pinmux.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define FREQ_396MHz (396000000U)
#define FREQ_480MHz (480000000U)
#define FREQ_528MHz (528000000U)
#define FREQ_24MHz (24000000U)
#define FREQ_1MHz (1000000U)
#define FREQ_400MHz (400U * FREQ_1MHz)

//!@brief OTFAD related bitmask
#define IOMUXC_GPR34_OTFAD1_EN_MASK (1u << 1)
#define IOMUXC_GPR35_OTFAD2_EN_MASK (1u << 1)

#define FLEXSPI_REMAP_ADDR_UNIT_IN_BYTES (4096ul)

//!@brief Address remap related defintions
typedef struct
{
    __IO uint32_t START;
    __IO uint32_t END;
    __IO uint32_t OFFSET;
} FLEXSPI_ADDR_REMAP_Type;

enum
{
    kImageSize_SecImageOffset = 0, // Image Size = Secondary Image Offset
    kImageSize_1MB = 1,
    kImageSize_2MB = 2,
    kImageSize_3MB = 3,
    kImageSize_4MB = 4,
    kImageSiz_5MB = 5,
    kImageSiz_6MB = 6,
    kImageSiz_7MB = 7,
    kImageSiz_8MB = 8,
    kImageSiz_9MB = 9,
    kImageSiz_10MB = 10,
    kImageSiz_11MB = 11,
    kImageSiz_12MB = 12,
    kImageSize_256KB = 13,
    kImageSize_512KB = 14,
    kImageSize_768KB = 15,
};

enum
{
    kFlashSize_1KB = 1024u,
    kFlashSize_256KB = 256 * kFlashSize_1KB,
    kFlashSize_1MB = (1024 * kFlashSize_1KB),
};

enum
{
    kHoldTime_500US = 0,
    kHoldTime_1MS = 1,
    kHoldTime_3MS = 2,
    kHoldTime_10MS = 3,
};

//!@brief FLEXSPI ROOT CLOCK soruce related definitions
enum
{
    kFlexSpiClkSrc_RC48M_Div2 = 0,
    kFlexSpiClkSrc_OSC = 1,
    kFlexSpiClkSrc_RC400M = 2,
    kFlexSpiClkSrc_RC4M_16M = 3,
    kFlexSpiClkSrc_PLL_480_PFD0 = 4,
    kFlexSpiClkSrc_PLL_528 = 5,
    kFlexSpiClkSrc_PLL_528_PFD2 = 6,
    kFlexSpiClkSrc_PLL_480 = 7,
};

enum
{
    kFlexSpiClkFreqSrc_Normal = 0,
    kFlexSpiClkFreqSrc_RC400M = 1,
    kFlexSpiClkFreqSrc_PLL480M = 2,
};

enum
{
    kFlashResetLogic_Disabled = 0,
    kFlashResetLogic_ResetPin = 1,
    kFlashResetLogic_JedecHwReset = 2,
};

typedef struct _flexspi_pinmux_
{
    uint32_t muxRegister;
    uint32_t muxMode;
    uint32_t inputRegister;
    uint32_t inputDaisy;
    uint32_t configRegister;
    uint32_t configValue;
} flexspi_pinmux_t;

typedef struct _flexspi_pinmux_group_
{
    flexspi_pinmux_t A_SS0;
    flexspi_pinmux_t A_SS1;
    flexspi_pinmux_t A_SCLK;
    flexspi_pinmux_t A_SCLKB;
    flexspi_pinmux_t A_DQS;
    flexspi_pinmux_t A_DQS_DUMMY;
    flexspi_pinmux_t A_DATA[8];
    flexspi_pinmux_t B_SS0;
    flexspi_pinmux_t B_SS1;
    flexspi_pinmux_t B_SCLK;
    flexspi_pinmux_t B_SCLKB;
    flexspi_pinmux_t B_DQS;
    flexspi_pinmux_t B_DQS_DUMMY;
    flexspi_pinmux_t B_DATA[8];
} flexspi_pinmux_group_t;

enum
{
    kFlexspiGroup_FlexSpi1_Primary = 0,
    kFlexspiGroup_FlexSpi1_Secondary = 1,
    kFlexspiGroup_FlexSpi2_Primary = 2,
    kFlexspiGroup_FlexSpi2_Secondary = 3,
    kFlexspiGroup_Max,
};

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static bool is_flexspi_clock_enabled(uint32_t instance);

/*******************************************************************************
 * Variables
 ******************************************************************************/

typedef struct
{
    uint8_t muxPadIndex;      // Index in IOMUXC_MUX_CTL and IOMUXC_PAD_CTL , 0 means this feature is not supported
    uint8_t muxValue;         // MUX value of Pin
    uint8_t selectInputIndex; // index in IOMUXC_SELECT_INPUT, 0 means this feature is not supported
    uint8_t selectInputValue; // Selece Input value
} flexspi_pad_attribute_t;

typedef struct
{
    uint32_t IOMUXC_IDX;
    uint32_t A_DQS_DUMMY_IOMUXC_IDX;
    uint32_t B_DQS_DUMMY_IOMUXC_IDX;
    flexspi_pad_attribute_t A_SS0;
    flexspi_pad_attribute_t A_SS1;
    flexspi_pad_attribute_t A_SCLK;
    flexspi_pad_attribute_t A_SCLKB;
    flexspi_pad_attribute_t A_DQS;
    flexspi_pad_attribute_t A_DQS_DUMMY;
    flexspi_pad_attribute_t A_DATA[8];
    flexspi_pad_attribute_t B_SS0;
    flexspi_pad_attribute_t B_SS1;
    flexspi_pad_attribute_t B_SCLK;
    flexspi_pad_attribute_t B_SCLKB;
    flexspi_pad_attribute_t B_DQS;
    flexspi_pad_attribute_t B_DQS_DUMMY;
    flexspi_pad_attribute_t B_DATA[8];
    uint32_t csPadSetting;
    uint32_t sclkPadSetting;
    uint32_t dataPadSetting;
    uint32_t dqsPadSetting;
} flexspi_pad_data_t;

enum
{
    kIomuxIdx_IOMUXC,
    kIomuxIdx_IOMUXC_AON,
};

enum
{
    kFlexspiPadDataIndex_FlexSpi1_Primary = 0,
    kFlexspiPadDataIndex_FlexSpi1_Secondary = 1,
    kFlexspiPadDataIndex_FlexSpi2_Primary = 2,
    kFlexspiPadDataIndex_FlexSpi2_Secondary = 3,
    kFlexspiPadDataIndex_Max,
};

// FlexSPI NOR Pin setting list
const flexspi_pad_data_t k_flexspi_pads[kFlexspiPadDataIndex_Max] = {
    // FLEXSPI1 PRIMARY
    {
        .IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .A_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .B_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .A_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_09, 7, 0, 0 },
        .A_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_01, 6, 0, 0 },
        .A_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_08, 7, 0, 0 },
        .A_SCLKB = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_02, 6, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 2 },
        .A_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_07, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 1 },
        .A_DQS_DUMMY = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_12_DUMMY, 0, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 0 },
        .A_DATA =
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_10, 7, 0, 0 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_11, 7, 0, 0 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_12, 7, 0, 0 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_13, 7, 0, 0 },
                // 4
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_03, 7, 0, 0 },
                // 5
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_04, 7, 0, 0 },
                // 6
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_05, 7, 0, 0 },
                // 7
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_06, 7, 0, 0 },
            },
        .B_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_06, 1, 0, 0 },
        .B_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_04, 1, 0, 0 },
        .B_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_07, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 0 },
        .B_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_05, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 0 },
        .B_DQS_DUMMY = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_12_DUMMY, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 1 },
        .B_DATA =
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_08, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 0 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_09, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 0 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_10, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 0 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_11, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 0 },

                // 4
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_00, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT4_SELECT_INPUT, 0 },
                // 5
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_01, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT5_SELECT_INPUT, 0 },
                // 6
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_02, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT6_SELECT_INPUT, 0 },
                // 7
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_03, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT7_SELECT_INPUT, 0 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-Pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
    // FLEXSPI1 SECONDARY
    {
        .IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .A_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .B_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .A_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_09, 7, 0, 0 }, // Primary pin group reused
        .A_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_01, 6, 0, 0 }, // Primary pin group reused
        .A_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_08, 7, 0, 0 }, // Primary pin group reused
        .A_SCLKB = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_02, 6, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 2 }, // Primary pin group reused
        .A_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_07, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 1 }, // Primary pin group reused
        .A_DQS_DUMMY = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_12_DUMMY, 0, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 0 }, // Primary pin group reused
        .A_DATA = // Primary pin group reused
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_10, 7, 0, 0 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_11, 7, 0, 0 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_12, 7, 0, 0 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_13, 7, 0, 0 },
                // 4
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_03, 7, 0, 0 },
                // 5
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_04, 7, 0, 0 },
                // 6
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_05, 7, 0, 0 },
                // 7
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B2_06, 7, 0, 0 },
            },
        .B_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_04, 7, 0, 0 },
        .B_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_02, 7, 0, 0 },
        .B_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_05, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 1 },
        .B_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_03, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 2 },
        .B_DQS_DUMMY = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B2_12_DUMMY, 1, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 1 },
        .B_DATA =
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 1 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 1 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 1 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 1 },

                // 4
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT4_SELECT_INPUT, 1 },
                // 5
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_08, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT5_SELECT_INPUT, 1 },
                // 6
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_07, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT6_SELECT_INPUT, 1 },
                // 7
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_B1_06, 7, kIOMUXC_FLEXSPI1_BUS2BIT_IPP_IND_IO_FB_BIT7_SELECT_INPUT, 1 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-Pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-Pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
    // FLEXSPI2 PRIMARY
    {
        .IOMUXC_IDX = kIomuxIdx_IOMUXC_AON,
        .A_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC_AON,
        .B_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC_AON,
        .A_SS0 = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_22, 0, 0, 0 },
        .A_SS1 = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20, 1, 0, 0 },
        .A_SCLK = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_23, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FA_SELECT_INPUT, 1 },
        .A_SCLKB = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 1 },
        .A_DQS = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_21, 8, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 1 },
        .A_DQS_DUMMY = {kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_28_DUMMY, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 2},
        .A_DATA =
            {
                // 0
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_24, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT0_SELECT_INPUT, 1 },
                // 1
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_25, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT1_SELECT_INPUT, 1 },
                // 2
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_26, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT2_SELECT_INPUT, 1 },
                // 3
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_27, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT3_SELECT_INPUT, 1 },
                // 4
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 2 },
                // 5
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_17, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 2 },
                // 6
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_16, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 2 },
                // 7
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 2 },
            },
        .B_SS0 = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_21, 0, 0, 0 },
        // .B_SS1 not available in the same io bank
        .B_SCLK = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_19, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 1 },
        .B_DQS = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_20, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 2 },
        .B_DQS_DUMMY = {kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_28_DUMMY, 1, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 3},
        .B_DATA =
            {
                // 0
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_18, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 2 },
                // 1
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_17, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 2 },
                // 2
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_16, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 2 },
                // 3
                { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 2 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_DSE(1),
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_DSE(1),
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_DSE(1),
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_DSE(1) | IOMUXC_SW_PAD_CTL_PAD_PUE(1),  // Pull down
    },
    // FLEXSPI2 SECONDARY
    {
        .IOMUXC_IDX = kIomuxIdx_IOMUXC,
        .A_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC_AON,
        .B_DQS_DUMMY_IOMUXC_IDX = kIomuxIdx_IOMUXC_AON,
        .A_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_39, 3, 0, 0 },
        .A_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_26, 3, 0, 0 },
        .A_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_41, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FA_SELECT_INPUT, 0 },
        .A_SCLKB = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_34, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 0 },
        .A_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_40, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 0 },
        .A_DQS_DUMMY = {kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_28_DUMMY, 0, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FA_SELECT_INPUT, 2},
        .A_DATA =
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_35, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT0_SELECT_INPUT, 0 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_36, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT1_SELECT_INPUT, 0 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_37, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT2_SELECT_INPUT, 0 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_38, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FA_BIT3_SELECT_INPUT, 0 },
                // 4
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_33, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 1 },
                // 5
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_32, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 1 },
                // 6
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_31, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 1 },
                // 7
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_30, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 1 },
            },
        .B_SS0 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_28, 3, 0, 0 },
        .B_SS1 = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_27, 3, 0, 0},
        .B_SCLK = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_34, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_SCK_FB_SELECT_INPUT, 0 },
        .B_DQS = { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_29, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 1 },
        .B_DQS_DUMMY = { kIOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_28_DUMMY, 1, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_DQS_FB_SELECT_INPUT, 3 },
        .B_DATA =
            {
                // 0
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_33, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT0_SELECT_INPUT, 1 },
                // 1
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_32, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT1_SELECT_INPUT, 1 },
                // 2
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_31, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT2_SELECT_INPUT, 1 },
                // 3
                { kIOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_B1_30, 3, kIOMUXC_FLEXSPI2_BUS2BIT_IPP_IND_IO_FB_BIT3_SELECT_INPUT, 1 },
            },
        .csPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3),   // No-pull
        .sclkPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dataPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(3), // No-pull
        .dqsPadSetting = IOMUXC_SW_PAD_CTL_PAD_PULL(2),  // Pull down
    },
};

