Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1189/src/flexspi_config_MIMXRT1189.c
typedef enum
{
    kFlexSpi1ClkSrc_RC24M = 0,
    kFlexSpi1ClkSrc_RC400M = 1,
    kFlexSpi1ClkSrc_PLL_480_PFD0 = 2,
    kFlexSpi1ClkSrc_PLL_528_PFD0 = 3,

    kFlexSpi2ClkSrc_RC24M = 0,
    kFlexSpi2ClkSrc_RC400M = 1,
    kFlexSpi2ClkSrc_PLL_480_PFD2 = 2,
    kFlexSpi2ClkSrc_PLL_528_PFD1 = 3,

    kFlexSpiClkSrc_MuxOpt_Num = 4,
} flexspi_clk_src_mux_t;

typedef enum
{
    kFlexSpiClkSrc_Type_Osc,
    kFlexSpiClkSrc_Type_PllDiv, // Including the PLL itself
    kFlexSpiClkSrc_Type_PllPfd,
} flexspi_clk_src_type_t;

typedef struct
{
    flexspi_clk_src_mux_t src_mux;
    flexspi_clk_src_type_t src_typ;
    union
    {
        struct
        {
            clock_pll_t pll_idx; // Available for kFlexSpiClkSrc_Type_PllPfd, kFlexSpiClkSrc_Type_PllDiv
            union
            {
                clock_pfd_t pfd_idx; // Available for kFlexSpiClkSrc_Type_PllPfd
                uint16_t pll_div;    // Available for kFlexSpiClkSrc_Type_PllDiv
            };
        };
        uint32_t osc_frq; // Available for kFlexSpiClkSrc_Type_Osc
    };
    struct
    {
        uint8_t pfd_frc; // pfd frac
        uint8_t clk_div; // clock root div
    } clk_cfg[kFlexSpiSerialClk_200MHz];
} flexspi_clk_freq_list_t;

enum
{
    kFlexSpi_1st_Inst = kFlexspiInstance_1,
    kFlexSpi_Last_Inst = kFlexspiInstance_2,
    kFlexSpi_Inst_Num = kFlexSpi_Last_Inst - kFlexSpi_1st_Inst + 1,
};

static const flexspi_clk_freq_list_t k_flexspi_clk_list_sdr[kFlexSpi_Inst_Num][kFlexSpiClkSrc_MuxOpt_Num] = {
    /* FlexSPI1 */
    {
        /* OSC_RC_24M */
        {
            .src_mux = kFlexSpi1ClkSrc_RC24M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_24MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
            },
        },
        /* RC400M */
        {
            .src_mux = kFlexSpi1ClkSrc_RC400M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_400MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 13}, /* 400MHz / 13 30.77MHz */ {0, 8}, /* 400MHz / 8 50MHz  */ {0, 6}, /* 400MHz / 6 66.67MHz */
                {0, 5 }, /* 400MHz / 5  80MHz    */ {0, 4}, /* 400MHz / 4 100MHz */ {0, 4}, /* 400MHz / 4 100MHz   */
                {0, 3 }, /* 400MHz / 3  133MHz   */ {0, 3}, /* 400MHz / 3 133MHz */ {0, 2}, /* 400MHz / 2 200MHz   */
            },
        },
        /* PLL480_PFD0 */
        {
            .src_mux = kFlexSpi1ClkSrc_PLL_480_PFD0,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys3,
            .pfd_idx = kCLOCK_Pfd0,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 18}, /* 480MHz * 18 / 16 / 18 30.00MHz  */ {29, 6 }, /* 480MHz * 18 / 29 / 6  49.66MHz  */ {16, 9 }, /* 480MHz * 18 / 16 / 9  60.00MHz  */
                {18, 6 }, /* 480MHz * 18 / 18 / 6  80.00MHz  */ {29, 3 }, /* 480MHz * 18 / 29 / 3  99.31MHz  */ {18, 4 }, /* 480MHz * 18 / 18 / 4  120.00MHz */
                {13, 5 }, /* 480MHz * 18 / 13 / 5  132.92MHz */ {13, 4 }, /* 480MHz * 18 / 13 / 4  166.15MHz */ {22, 2 }, /* 480MHz * 18 / 22 / 2  196.36MHz */
            },
        },
        /* PLL528_PFD0 */
        {
            .src_mux = kFlexSpi1ClkSrc_PLL_528_PFD0,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys2,
            .pfd_idx = kCLOCK_Pfd0,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {15, 21}, /* 528MHz * 18 / 15 / 21 30.17MHz  */ {19, 10}, /* 528MHz * 18 / 19 / 10 50.02MHz  */ {16, 10}, /* 528MHz * 18 / 16 / 10 59.40MHz  */
                {17, 7 }, /* 528MHz * 18 / 17 / 7  79.87MHz  */ {19, 5 }, /* 528MHz * 18 / 19 / 5  100.04MHz */ {16, 5 }, /* 528MHz * 18 / 16 / 5  118.80MHz */
                {18, 4 }, /* 528MHz * 18 / 18 / 4  132.00MHz */ {19, 3 }, /* 528MHz * 18 / 19 / 3  166.74MHz */ {16, 3 }, /* 528MHz * 18 / 16 / 3  198.00MHz */
            },
        },
    },
    /* FlexSPI2 */
    {
        /* OSC_RC_24M */
        {
            .src_mux = kFlexSpi2ClkSrc_RC24M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_24MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
            },
        },
        /* RC400M */
        {
            .src_mux = kFlexSpi2ClkSrc_RC400M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_400MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 13}, /* 400MHz / 13 30.77MHz*/ {0, 8}, /* 400MHz / 8 50MHz  */ {0, 6}, /* 400MHz / 6 66.67MHz */
                {0, 5 }, /* 400MHz / 5  80MHz   */ {0, 4}, /* 400MHz / 4 100MHz */ {0, 4}, /* 400MHz / 4 100MHz   */
                {0, 3 }, /* 400MHz / 3  133MHz  */ {0, 3}, /* 400MHz / 3 133MHz */ {0, 2}, /* 400MHz / 2 200MHz   */
            },
        },
        /* PLL480_PFD2 */
        {
            .src_mux = kFlexSpi2ClkSrc_PLL_480_PFD2,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys3,
            .pfd_idx = kCLOCK_Pfd2,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 18}, /* 480MHz * 18 / 16 / 18 30.00MHz  */ {29, 6 }, /* 480MHz * 18 / 29 / 6  49.66MHz  */ {16, 9 }, /* 480MHz * 18 / 16 / 9  60.00MHz  */
                {18, 6 }, /* 480MHz * 18 / 18 / 6  80.00MHz  */ {29, 3 }, /* 480MHz * 18 / 29 / 3  99.31MHz  */ {18, 4 }, /* 480MHz * 18 / 18 / 4  120.00MHz */
                {13, 5 }, /* 480MHz * 18 / 13 / 5  132.92MHz */ {13, 4 }, /* 480MHz * 18 / 13 / 4  166.15MHz */ {22, 2 }, /* 480MHz * 18 / 22 / 2  196.36MHz */
            },
        },
        /* PLL528_PFD1 */
        {
            .src_mux = kFlexSpi2ClkSrc_PLL_528_PFD1,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys2,
            .pfd_idx = kCLOCK_Pfd1,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {15, 21}, /* 528MHz * 18 / 15 / 21 30.17MHz  */ {19, 10}, /* 528MHz * 18 / 19 / 10 50.02MHz  */ {16, 10}, /* 528MHz * 18 / 16 / 10 59.40MHz   */
                {17, 7 }, /* 528MHz * 18 / 17 / 7  79.87MHz  */ {19, 5 }, /* 528MHz * 18 / 19 / 5  100.04MHz */ {16, 5 },  /* 528MHz * 18 / 16 / 5  118.80MHz */
                {18, 4 }, /* 528MHz * 18 / 18 / 4  132.00MHz */ {19, 3 }, /* 528MHz * 18 / 19 / 3  166.74MHz */ {16, 3 },  /* 528MHz * 18 / 16 / 3  198.00MHz */
            },
        },
    },
};

// Formula: Clock(src) / div / 2
static const flexspi_clk_freq_list_t k_flexspi_clk_list_ddr[kFlexSpi_Inst_Num][kFlexSpiClkSrc_MuxOpt_Num] = {
    /* FlexSPI1 */
    {
        /* OSC_RC_24M */
        {
            .src_mux = kFlexSpi1ClkSrc_RC24M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_24MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
                {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */ {0, 1}, /* 24MHz */
            },
        },
        /* RC400M */
        {
            .src_mux = kFlexSpi1ClkSrc_RC400M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_400MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 6}, /* 400MHz / 6 33.33MHz*2 */ {0, 4}, /* 400MHz / 4 50MHz*2  */ {0, 3}, /* 400MHz / 3 66.67MHz*2 */
                {0, 3}, /* 400MHz / 3 66.67MHz*2 */ {0, 2}, /* 400MHz / 2 100MHz*2 */ {0, 2}, /* 400MHz / 2 100MHz*2   */
                {0, 2}, /* 400MHz / 2 100MHz*2   */ {0, 2}, /* 400MHz / 2 100MHz*2 */ {0, 1}, /* 400MHz / 1 200MHz*2   */
            },
        },
        /* PLL480_PFD0 */
        {
            .src_mux = kFlexSpi1ClkSrc_PLL_480_PFD0,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys3,
            .pfd_idx = kCLOCK_Pfd0,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 9}, /* 480MHz * 18 / 16 / 9 30.00MHz*2  */ {29, 3}, /* 480MHz * 18 / 29 / 3 49.66MHz*2  */ {18, 4}, /* 480MHz * 18 / 18 / 4 60.00MHz*2  */
                {18, 3}, /* 480MHz * 18 / 18 / 3 80.00MHz*2  */ {22, 2}, /* 480MHz * 18 / 22 / 2 98.18MHz*2  */ {18, 2}, /* 480MHz * 18 / 18 / 2 120.00MHz*2 */
                {16, 2}, /* 480MHz * 18 / 16 / 2 135.00MHz*2 */ {13, 2}, /* 480MHz * 18 / 13 / 2 166.15MHz*2 */ {22, 1}, /* 480MHz * 18 / 22 / 1 196.36MHz*2 */
            },
        },
        /* PLL_528_PFD0 */
        {
            .src_mux = kFlexSpi1ClkSrc_PLL_528_PFD0,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys2,
            .pfd_idx = kCLOCK_Pfd0,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 10}, /* 528MHz * 18 / 16 / 10 29.70MHz*2  */ {19, 5}, /* 528MHz * 18 / 19 / 5  50.02MHz*2  */ {16, 5}, /* 528MHz * 18 / 16 / 5  59.40MHz*2  */
                {15, 4 }, /* 528MHz * 18 / 15 / 4  79.20MHz*2  */ {16, 3}, /* 528MHz * 18 / 16 / 3  99.00MHz*2  */ {20, 2}, /* 528MHz * 18 / 20 / 2  118.80MHz*2 */
                {18, 2 }, /* 528MHz * 18 / 18 / 2  132.00MHz*2 */ {29, 1}, /* 528MHz * 18 / 29 / 1  163.86MHz*2 */ {24, 1}, /* 528MHz * 18 / 24 / 1  198.00MHz*2 */
            },
        },
    },
    /* FlexSPI2 */
    {
        /* OSC_RC_24M */
        {
            .src_mux = kFlexSpi2ClkSrc_RC24M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_24MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */
                {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */
                {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */ {0, 1}, /* 12MHz*2 */
            },
        },
        /* RC400M */
        {
            .src_mux = kFlexSpi2ClkSrc_RC400M,
            .src_typ = kFlexSpiClkSrc_Type_Osc,
            .osc_frq = FREQ_400MHz,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
               {0, 6}, /* 400MHz / 6 33.33MHz*2 */ {0, 4}, /* 400MHz / 4 50MHz*2  */ {0, 3}, /* 400MHz / 3 66.67MHz*2 */
               {0, 3}, /* 400MHz / 3 66.67MHz*2 */ {0, 2}, /* 400MHz / 2 100MHz*2 */ {0, 2}, /* 400MHz / 2 100MHz*2   */
               {0, 2}, /* 400MHz / 2 100MHz*2   */ {0, 2}, /* 400MHz / 2 100MHz*2 */ {0, 1}, /* 400MHz / 1 200MHz*2   */
            },
        },
        /* PLL480_PFD2 */
        {
            .src_mux = kFlexSpi2ClkSrc_PLL_480_PFD2,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys3,
            .pfd_idx = kCLOCK_Pfd2,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 9}, /* 480MHz * 18 / 16 / 9 30.00MHz*2  */ {29, 3}, /* 480MHz * 18 / 29 / 3 49.66MHz*2  */ {18, 4}, /* 480MHz * 18 / 18 / 4 60.00MHz*2  */
                {18, 3}, /* 480MHz * 18 / 18 / 3 80.00MHz*2  */ {22, 2}, /* 480MHz * 18 / 22 / 2 98.18MHz*2  */ {18, 2}, /* 480MHz * 18 / 18 / 2 120.00MHz*2 */
                {16, 2}, /* 480MHz * 18 / 16 / 2 135.00MHz*2 */ {13, 2}, /* 480MHz * 18 / 13 / 2 166.15MHz*2 */ {22, 1}, /* 480MHz * 18 / 22 / 1 196.36MHz*2 */
            },
        },
        /* PLL528_PFD1 */
        {
            .src_mux = kFlexSpi2ClkSrc_PLL_528_PFD1,
            .src_typ = kFlexSpiClkSrc_Type_PllPfd,
            .pll_idx = kCLOCK_PllSys2,
            .pfd_idx = kCLOCK_Pfd1,
            .clk_cfg = {
                /* *18/frac(13~35) | /div(1~256) */
                {16, 10}, /* 528MHz * 18 / 16 / 10 29.70MHz*2  */ {19, 5}, /* 528MHz * 18 / 19 / 5  50.02MHz*2  */ {16, 5}, /* 528MHz * 18 / 16 / 5  59.40MHz*2  */
                {15, 4 }, /* 528MHz * 18 / 15 / 4  79.20MHz*2  */ {16, 3}, /* 528MHz * 18 / 16 / 3  99.00MHz*2  */ {20, 2}, /* 528MHz * 18 / 20 / 2  118.80MHz*2 */
                {18, 2 }, /* 528MHz * 18 / 18 / 2  132.00MHz*2 */ {29, 1}, /* 528MHz * 18 / 29 / 1  163.86MHz*2 */ {24, 1}, /* 528MHz * 18 / 24 / 1  198.00MHz*2 */
            },
        },
    },
};
FLEXSPI_Type *const g_flexSpiInstances[] = FLEXSPI_BASE_PTRS;

