Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1189/src/flexspi_config_MIMXRT1189.c
    if (config->controllerMiscOption & FLEXSPI_BITMASK(kFlexSpiMiscOffset_SecondPinMux))
    {
        debug_printf("%s, secondary pin group is selected", __func__);
        group = kFlexSpi_SecondaryGroup;
    }

    // Get the index of the pad setting entry
    uint32_t padSettingIndex = GET_FLEXSPI_PIN_TBL_IDX(instance, group);
    const flexspi_pad_data_t *padData = &k_flexspi_pads[padSettingIndex];
    if (padData->IOMUXC_IDX == kIomuxIdx_IOMUXC)
    {
        flexspi_iomux_config_on_iomuxc(padData, config);
    }
    else
    {
        flexspi_iomux_config_on_iomuxc_aon(padData, config);
    }
}
void flexspi_sw_delay_us(uint64_t us)
{
    uint32_t ticks_per_us = CLOCK_GetFreq(kCLOCK_CpuClk) / 1000000;
    while (us--)
    {
        register uint32_t ticks = 1 + ticks_per_us / 4;
        while (ticks--)
        {
            __NOP();
        }
    }
}

//!@brief Get maximum frequency supported by FlexSPI
status_t flexspi_get_max_supported_freq(uint32_t instance, uint32_t *freq, uint32_t clkMode)
{
    status_t status = kStatus_InvalidArgument;
    do
    {
        if (freq == NULL)
        {
            break;
        }

        *freq = (166UL * 1000 * 1000);
        status = kStatus_Success;

    } while (0);

    return status;
}

//!@brief Set FlexSPI failsafe setting
status_t flexspi_set_failsafe_setting(flexspi_mem_config_t *config)
{
    (void)config;

    return kStatus_Success;
}

// Update Clock Source
status_t flexspi_update_clock_source(uint32_t instance, uint32_t source)
{
    status_t status = kStatus_InvalidArgument;

    do
    {
        if ((instance < kFlexspiInstance_1) || (instance > kFlexspiInstance_2) || (source > kFlexSpiClkSrc_PLL_480))
        {
            break;
        }

        volatile uint32_t *clkRootRegister = NULL;
        if (instance == kFlexspiInstance_1)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCLOCK_Root_Flexspi1].CONTROL;
        }
        else if (instance == kFlexspiInstance_2)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCLOCK_Root_Flexspi2].CONTROL;
        }

        uint32_t expectedRegValue =
            ((*clkRootRegister) & ~CCM_CLOCK_ROOT_CONTROL_MUX_MASK) | CCM_CLOCK_ROOT_CONTROL_MUX(source);
        FLEXSPI_Type *g_flexspiInstances[] = FLEXSPI_BASE_PTRS;
        if (expectedRegValue != *clkRootRegister)
        {
            // Disable FlexSPI before clock switch
            bool needRestoreClock = false;
            if (is_flexspi_clock_enabled(instance))
            {
                g_flexspiInstances[instance]->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
                flexspi_clock_gate_disable(instance);

                needRestoreClock = true;
            }
            *clkRootRegister = expectedRegValue;

            if (needRestoreClock)
            {
                // Restore FlexSPI after clock switch
                flexspi_clock_gate_enable(instance);
                g_flexspiInstances[instance]->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;
            }
        }

        status = kStatus_Success;

    } while (0);

    return status;
}

//!@brief Configure clock for FlexSPI peripheral
void flexspi_clock_config(uint32_t instance, uint32_t freq, uint32_t sampleClkMode)
{
#if !defined(BL_TARGET_FPGA)
    do
    {
        if ((sampleClkMode > kFlexSpiClk_DDR) || (freq < 1U))
        {
            break;
        }

        if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
        {
            break;
        }

        volatile uint32_t *clkRootRegister = NULL;
        if (instance == kFlexspiInstance_1)
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCLOCK_Root_Flexspi1].CONTROL;
        }
        else
        {
            clkRootRegister = &CCM->CLOCK_ROOT[kCLOCK_Root_Flexspi2].CONTROL;
        }

        uint32_t freqSrc = ((*clkRootRegister) & CCM_CLOCK_ROOT_CONTROL_MUX_MASK) >> CCM_CLOCK_ROOT_CONTROL_MUX_SHIFT;

        if (freqSrc >= kFlexSpiClkSrc_MuxOpt_Num)
        {
            break;
        }

        uint32_t srcMux;    // Clock root mux
        uint32_t srcTyp;    // Clock source type
        clock_pll_t pllIdx; // PLL index (if available)
        clock_pfd_t pfdIdx; // PFD index (if available)
        uint32_t pfdFrc;    // PFD frac (if available)
        uint32_t clkDiv;    // Clock root divider

        const flexspi_clk_freq_list_t *freq_list = &k_flexspi_clk_list_sdr[instance - kFlexSpi_1st_Inst][freqSrc];
        if (sampleClkMode == kFlexSpiClk_DDR)
        {
            freq_list = &k_flexspi_clk_list_ddr[instance - kFlexSpi_1st_Inst][freqSrc];
        }

        if (freq > kFlexSpiSerialClk_200MHz)
        {
            freq = kFlexSpiSerialClk_SafeFreq;
        }

        srcMux = freq_list->src_mux;
        srcTyp = freq_list->src_typ;
        pllIdx = freq_list->pll_idx;
        pfdIdx = freq_list->pfd_idx;
        pfdFrc = freq_list->clk_cfg[freq - 1].pfd_frc; // PLL/PFD's frac: 13~35
        clkDiv = freq_list->clk_cfg[freq - 1].clk_div; // Clock root's div: 1~256

        uint32_t tmpClkRootRegValue = CCM_CLOCK_ROOT_CONTROL_DIV(clkDiv - 1) | CCM_CLOCK_ROOT_CONTROL_MUX(srcMux);

        // Disable FlexSPI before clock switch
        if (is_flexspi_clock_enabled(instance))
        {
            g_flexSpiInstances[instance]->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
            flexspi_clock_gate_disable(instance);
        }

        // Update FLEXSPI clock root setting as needed
        if (tmpClkRootRegValue != *clkRootRegister)
        {
            if (kFlexSpiClkSrc_Type_PllPfd == srcTyp)
            {
                CLOCK_InitPfd(pllIdx, pfdIdx, pfdFrc);
            }

            *clkRootRegister = tmpClkRootRegValue;
            (void)*clkRootRegister; // Intentionally readback for write-sync
        }

        // Restore FlexSPI after clock switch
        flexspi_clock_gate_enable(instance);
        g_flexSpiInstances[instance]->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;

        uint32_t serialRootClk = 0;
        flexspi_get_clock(instance, kFlexSpiClock_SerialRootClock, &serialRootClk);

        debug_printf("%s: expected freq=%d, configured clk root=%d", __func__, freq, serialRootClk);
    } while (0);
#endif
}

//!@brief Gate on the clock for the FlexSPI peripheral
void flexspi_clock_gate_enable(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi2].DIRECT;
    }

    if (reg != NULL)
    {
        *reg = 1;

        __DSB();
        __ISB();
    }
}

//!@brief Gate off the clock the FlexSPI peripheral
void flexspi_clock_gate_disable(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi2].DIRECT;
    }

    if (reg != NULL)
    {
        *reg = 0;

        __DSB();
        __ISB();
    }
}

