Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1189/src/flexspi_config_MIMXRT1189.c
bool is_flexspi_clock_enabled(uint32_t instance)
{
    volatile uint32_t *reg = NULL;
    bool isEnabled = false;
    if (instance == kFlexspiInstance_1)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi1].DIRECT;
    }
    else if (instance == kFlexspiInstance_2)
    {
        reg = &CCM->LPCG[kCLOCK_Flexspi2].DIRECT;
    }
    if (reg != NULL)
    {
        isEnabled = *reg ? true : false;
    }

    return isEnabled;
}

void flexspi_update_padsetting(uint32_t instance, flexspi_mem_config_t *config, uint32_t padSetting)
{
#define PAD_SLEW(padSetting) (((padSetting) >> 0x0U) & 0x1U)
#define PAD_DRV(padSetting) (((padSetting) >> 0x1U) & 0x1U)
#define PAD_PULL(padSetting) (((padSetting) >> 0x2U) & 0x1U)

    if ((instance != kFlexspiInstance_1) && (instance != kFlexspiInstance_2))
    {
        return;
    }

    if (NULL == config)
    {
        return;
    }

    uint32_t group = (config->controllerMiscOption & FLEXSPI_BITMASK(kFlexSpiMiscOffset_SecondPinMux)) ?
                         kFlexSpiPinGroup_Secondary :
                         kFlexSpiPinGroup_Primary;
    const flexspi_pad_data_t *padData = &k_flexspi_pads[GET_FLEXSPI_PIN_TBL_IDX(instance, group)];

    config->csPadSettingOverrideEn = 1;
    config->sclkPadSettingOverrideEn = 1;
    config->dataPadSettingOverrideEn = 1;

    if (kIomuxIdx_IOMUXC == padData->IOMUXC_IDX)
    {
        config->csPadSettingOverride =
            PAD_PULL(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PULL(1) : IOMUXC_SW_PAD_CTL_PAD_PULL(3);
        config->csPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PDRV(0) : IOMUXC_SW_PAD_CTL_PAD_PDRV(1);
        config->sclkPadSettingOverride =
            PAD_PULL(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PULL(1) : IOMUXC_SW_PAD_CTL_PAD_PULL(3);
        config->sclkPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PDRV(0) : IOMUXC_SW_PAD_CTL_PAD_PDRV(1);
        config->dataPadSettingOverride =
            PAD_PULL(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PULL(1) : IOMUXC_SW_PAD_CTL_PAD_PULL(3);
        config->dataPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PDRV(0) : IOMUXC_SW_PAD_CTL_PAD_PDRV(1);
    }
    else // kIomuxIdx_IOMUXC_AON
    {
        config->csPadSettingOverride = PAD_PULL(padSetting) ?
                                           (IOMUXC_SW_PAD_CTL_PAD_PUE(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1)) :
                                           IOMUXC_SW_PAD_CTL_PAD_PUE(0);
        config->csPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_DSE(1) : IOMUXC_SW_PAD_CTL_PAD_DSE(0);
        config->csPadSettingOverride |=
            PAD_SLEW(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_SRE(0) : IOMUXC_SW_PAD_CTL_PAD_SRE(1);
        config->sclkPadSettingOverride = PAD_PULL(padSetting) ?
                                             (IOMUXC_SW_PAD_CTL_PAD_PUE(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1)) :
                                             IOMUXC_SW_PAD_CTL_PAD_PUE(0);
        config->sclkPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_DSE(1) : IOMUXC_SW_PAD_CTL_PAD_DSE(0);
        config->sclkPadSettingOverride |=
            PAD_SLEW(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_SRE(0) : IOMUXC_SW_PAD_CTL_PAD_SRE(1);
        config->dataPadSettingOverride = PAD_PULL(padSetting) ?
                                             (IOMUXC_SW_PAD_CTL_PAD_PUE(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1)) :
                                             IOMUXC_SW_PAD_CTL_PAD_PUE(0);
        config->dataPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_DSE(1) : IOMUXC_SW_PAD_CTL_PAD_DSE(0);
        config->dataPadSettingOverride |=
            PAD_SLEW(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_SRE(0) : IOMUXC_SW_PAD_CTL_PAD_SRE(1);
    }

    config->dqsPadSettingOverrideEn = 1;

    if ((kIomuxIdx_IOMUXC == padData->A_DQS_DUMMY_IOMUXC_IDX) || (kIomuxIdx_IOMUXC == padData->B_DQS_DUMMY_IOMUXC_IDX))
    {
        config->dqsPadSettingOverride =
            PAD_PULL(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PULL(2) : IOMUXC_SW_PAD_CTL_PAD_PULL(3);
        config->dqsPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_PDRV(0) : IOMUXC_SW_PAD_CTL_PAD_PDRV(1);
    }
    else // kIomuxIdx_IOMUXC_AON
    {
        config->dqsPadSettingOverride = PAD_PULL(padSetting) ?
                                            (IOMUXC_SW_PAD_CTL_PAD_PUE(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(0)) :
                                            IOMUXC_SW_PAD_CTL_PAD_PUE(0);
        config->dqsPadSettingOverride |=
            PAD_DRV(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_DSE(1) : IOMUXC_SW_PAD_CTL_PAD_DSE(0);
        config->dqsPadSettingOverride |=
            PAD_SLEW(padSetting) ? IOMUXC_SW_PAD_CTL_PAD_SRE(0) : IOMUXC_SW_PAD_CTL_PAD_SRE(1);
    }
}
